app/controllers/articles_controller.rb

	def show
    	@article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

	def create
		# render plain: params[:article].inspect
		@article = Article.new(article_params)

	    if @article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('', '', '2015-08-09 00:52:41', '2015-08-09 00:52:41')

    def edit
 		 @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1

    def update
		@article = Article.find(params[:id])
		  if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
UPDATE `articles` SET `text` = 'dsadfdsafsadsd', `updated_at` = '2015-08-09 06:43:03' WHERE `articles`.`id` = 3